## Step 1 - Connect

In [1]:
%run ../connect.ipynb

## Step 2 - Question

```
Table: Person

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| personId    | int     |
| lastName    | varchar |
| firstName   | varchar |
+-------------+---------+
personId is the primary key column for this table.
This table contains information about the ID of some persons and their first and last names.
 

Table: Address

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| addressId   | int     |
| personId    | int     |
| city        | varchar |
| state       | varchar |
+-------------+---------+
addressId is the primary key column for this table.
Each row of this table contains information about the city and state of one person with ID = PersonId.
 

Write an SQL query to report the first name, last name, city, and state of each person in the Person table. If the address of a personId is not present in the Address table, report null instead.

Return the result table in any order.

The query result format is in the following example.

 

Example 1:

Input: 
Person table:
+----------+----------+-----------+
| personId | lastName | firstName |
+----------+----------+-----------+
| 1        | Wang     | Allen     |
| 2        | Alice    | Bob       |
+----------+----------+-----------+
Address table:
+-----------+----------+---------------+------------+
| addressId | personId | city          | state      |
+-----------+----------+---------------+------------+
| 1         | 2        | New York City | New York   |
| 2         | 3        | Leetcode      | California |
+-----------+----------+---------------+------------+
Output: 
+-----------+----------+---------------+----------+
| firstName | lastName | city          | state    |
+-----------+----------+---------------+----------+
| Allen     | Wang     | Null          | Null     |
| Bob       | Alice    | New York City | New York |
+-----------+----------+---------------+----------+
Explanation: 
There is no address in the address table for the personId = 1 so we return null in their city and state.
addressId = 1 contains information about the address of personId = 2.
```

## Step 3 - Insert Data

In [5]:
%%sql
DROP TABLE IF EXISTS PERSON;
CREATE TABLE PERSON (personId int, firstName varchar(255), lastName varchar(255));
INSERT INTO PERSON (personId, lastName, firstName) values ('1', 'Wang', 'Allen');
INSERT INTO PERSON (personId, lastName, firstName) values ('2', 'Alice', 'Bob');

DROP TABLE IF EXISTS ADDRESS;
CREATE TABLE ADDRESS (addressId int, personId int, city varchar(255), state varchar(255));
INSERT INTO ADDRESS (addressId, personId, city, state) values ('1', '2', 'New York City', 'New York');
INSERT INTO ADDRESS (addressId, personId, city, state) values ('2', '3', 'Leetcode', 'California');

Empty DataFrame
Columns: []
Index: []

## Step 4 - Answer

In [6]:
%%sql
SELECT FirstName,
    LastName,
    City,
    State
FROM Person
    LEFT JOIN Address ON Person.PersonId = Address.PersonId

  FirstName LastName           City     State
0     Allen     Wang           None      None
1       Bob    Alice  New York City  New York